app/controllers/couriers_controller.rb

SELECT "couriers".* FROM "couriers"
---
  def index
    @couriers = Courier.all

SELECT "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @courier = Courier.find(params[:id])

INSERT INTO "couriers" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test"], ["email", "Test email"], ["created_at", "2021-07-19 13:03:53.885971"], ["updated_at", "2021-07-19 13:03:53.885971"]]
---
  def create
    @courier = Courier.new(courier_params)

    if @courier.save

SELECT "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @courier = Courier.find(params[:id])

SELECT "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "couriers" SET "name" = $1, "updated_at" = $2 WHERE "couriers"."id" = $3  [["name", "Andrey@"], ["updated_at", "2021-07-19 13:20:11.614128"], ["id", 1]]
---
  def update
    @courier = Courier.find(params[:id])

    if @courier.update(courier_params)

SELECT "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "couriers" WHERE "couriers"."id" = $1  [["id", 4]]
---
  def destroy
    @courier = Courier.find(params[:id])
    @courier.destroy