app/controllers/packages_controller.rb

SELECT "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "packages" ("tracking_number", "delivery_status", "courier_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["tracking_number", "1"], ["delivery_status", true], ["courier_id", 2], ["created_at", "2021-07-19 19:15:30.032421"], ["updated_at", "2021-07-19 19:15:30.032421"]]
---
    def create
        @courier = Courier.find(params[:courier_id])
        @package = @courier.packages.create(package_params)